title: System Information Discovery
id: 57d6175c-0639-4e58-ac21-a9c9d151afbf
status: test
description: Detects common Discovery commands
references:
    - https://www.atomicredteam.io/atomic-red-team/atomics/T1033
author: Ismaeel A 
date: 2025-09-04
tags:
    - attack.t1033
logsource:
    category: process_creation
    product: windows
detection:
    discovery:
        CommandLine|contains:
            - 'systeminfo'
            - '/c whoami'
            - 'net group'
            - 'net view'
    condition: discovery
falsepositives:
    - Admin activity
level: low
